Revit 2024 API
Truss.RemoveProfile Method
Remove the profile of a truss.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public void RemoveProfile()
Visual Basic
Public Sub RemoveProfile
Visual C++
public:
void RemoveProfile()
See Also
Truss Class
Autodesk.Revit.DB.Structure Namespace